---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross.CantileverLength
source: html/0a1bf912-867b-9e65-f34a-0ebd8432a364.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross.CantileverLength Property

Flange cantilever length.

## Syntax (C#)
```csharp
public double CantileverLength { get; set; }
```